org.eclipse.swordfish.samples/org.eclipse.swordfish.demo.jaxws/src/main/java/org/eclipse/swordfish/samples/jaxws/storage/reservation.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <soap:Header>
        <wsa:Action>
            http://storage.jaxws.samples.swordfish.eclipse.org//ReservationStorageService/addReservation
        </wsa:Action>
    </soap:Header>
    <soap:Body>
        <ns2:addReservation
            xmlns:ns2="http://cxf.samples.swordfish.eclipse.org/">
            <reservation>
                <passengers>
                    <age>24</age>
                    <firstName>Volodymyr</firstName>
                    <id>1</id>
                    <lastName>Zhabiuk</lastName>
                </passengers>
                <flight>
                    <flightNumber>LC023</flightNumber>
                    <id>1</id>
                </flight>
            </reservation>
        </ns2:addReservation>
    </soap:Body>
</soap:Envelope>